In [1]:
import pandas as pd

In [2]:
ds=pd.read_csv('titanic_1.csv')

In [3]:
ds

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

3. Show first 5 rows

In [4]:
ds.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

4. Describe the data

In [5]:
ds.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

5. Show the first row

In [6]:
ds.loc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

OR

In [7]:
ds.head(1)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1

6. Show all rows upto the fourth row

In [8]:
ds.head(4)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

7. Show top 2 rows where column ‘sex’ is ‘female’

In [9]:
(ds[ds['Sex']=='female']).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

OR

In [10]:
ds[ds['Sex']=='female'][:2]

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

8. Select all rows where passenger is female 65 or older

In [11]:
ds[(ds['Sex']=='female')&(ds['Age']>=65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

9. How many males and females were on board

In [12]:
ds['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

10. Group the data by ‘sex’ and find the mean age of each group

In [13]:
(ds.groupby('Sex')).mean()['Age']

Sex
female    29.396424
male      31.014338
Name: Age, dtype: float64

OR

In [14]:
ds[['Sex','Age']].groupby('Sex').mean()

              Age
Sex
female  29.396424
male    31.014338

11. Show first two names in upper case using list comprehension

In [15]:
[ds.loc[i]['Name'].upper() for i in range(0,2)]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

OR

In [16]:
ds['Name'][:2].apply(lambda x:x.upper())

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

12. Using apply function, convert the name for all data to uppercase

In [17]:
ds['Name'] = ds['Name'].apply(lambda x:x.upper())

In [18]:
ds

,Name,PClass,Age,Sex,Survived,SexCode
0,"ALLEN, MISS ELISABETH WALTON",1st,29.00,female,1,1
1,"ALLISON, MISS HELEN LORAINE",1st,2.00,female,0,1
2,"ALLISON, MR HUDSON JOSHUA CREIGHTON",1st,30.00,male,0,0
3,"ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)",1st,25.00,female,0,1
4,"ALLISON, MASTER HUDSON TREVOR",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"ZAKARIAN, MR ARTUN",3rd,27.00,male,0,0
1309,"ZAKARIAN, MR MAPRIEDER",3rd,26.00,male,0,0
1310,"ZENNI, MR PHILIP",3rd,22.00,male,0,0
1311,"LIEVENS, MR RENE",3rd,24.00,male,0,0
1312,"ZIMMERMAN, LEO",3rd,29.00,male,0,0

13.Count the number of male and female survivors

In [19]:
ds[ds['Survived']==1]['Sex'].value_counts()

female    308
male      142
Name: Sex, dtype: int64

14.Percentage of Female Survivors

In [20]:
ds7 = ds[ds['Sex']=='female']['Survived'].value_counts()

In [21]:
(ds7[1])/(ds7.sum())*100
#Percentage

66.66666666666666

15.Percentage of Male Survivors

In [25]:
ds7 = ds[ds['Sex']=='male']['Survived'].value_counts()

In [26]:
ds7

0    709
1    142
Name: Survived, dtype: int64

In [23]:
(ds7[1])/(ds7.sum())*100
#Percentage

16.686251468860164

14.Survivor Count based on Age.

In [24]:
ds[['Age','Survived']].value_counts()

Age    Survived
30.00  0           23
22.00  0           22
21.00  0           21
18.00  0           19
26.00  0           19
                   ..
14.00  1            1
15.00  0            1
46.00  1            1
0.33   0            1
0.17   1            1
Length: 130, dtype: int64